* Tasks :noexport:
** Create flashcard exercises for ase commands
* build                                                            :noexport:

** The PDF build
Here we create the tex file. This extracts the scripts out to the dft-scripts folder.
#+BEGIN_SRC emacs-lisp
(load-file "dft.el")

(let ((async nil)
      (subtreep nil)
      (visible-only nil)
      (body-only nil))
  (ignore-errors
    (delete-file "dft.aux")
    (delete-file "dft.bbl")
    (delete-file "dft.pdf"))

(setq counter 0)

  (defun ox-mrkup-filter-src-block (text back-end info)
    (setq counter (+ counter 1))

    (let ((filename (format "dft-scripts/script-%d.py" counter)))
      (with-temp-buffer
        (insert (mapconcat 'identity (butlast (cdr (split-string text "\n" t))) "\n"))
        (write-region (point-min) (point-max) filename))

      (format "%s

\\LaunchBinary{%s}{Open the python script (%s).}

" text filename filename)))

(let ((org-export-filter-src-block-functions '(ox-mrkup-filter-src-block)))
  (list
   (org-latex-export-to-latex async subtreep visible-only body-only
			      '(:with-author t
					     :with-date t
					     :with-title t
					     :with-timestamps t
					     :with-todo-keywords t
					     :with-toc nil))
   (current-time-string))))


(shell-command "pdflatex -shell-escape -interaction=batchmode dft")
(shell-command "bibtex dft")
(shell-command "makeindex dft")
(shell-command "pdflatex -shell-escape  -interaction=batchmode dft")
(shell-command "pdflatex -shell-escape  -interaction=batchmode dft")
(shell-command "rm -f blog/source/files/dft.pdf")
(shell-command "cp -f dft.pdf blog/source/files")
;; delete some files
(mapcar (lambda (ext)
          (let ((filename (concat "dft" ext)))
            (when (file-exists-p filename) (delete-file filename))))
        '(".sol" "_xdefs.cut" ".aux" ".ind" ".ilg" ".idx"
          ".bbl" ".qsl" ".out" ".log" ".blg"))

(mapcar (lambda (x)
          (when (file-exists-p x) (delete-file x)))
        '("exerquiz.djs" "dljslib.ljs" "dljslib.djs" "texput.log" ".tex"))

(save-buffer)
(princ (format "dft was built on %s" (current-time-string)))
#+END_SRC

#+RESULTS:
: dft was built on Thu Jul 21 16:24:13 2016

** build the html						    :archive:

#+BEGIN_SRC emacs-lisp
(load-file "dft.el")
(find-file "dft.org")
(require 'ox-publish)
(setq org-publish-project-alist
      '(
	("dft-book-content"
	 :base-directory "~/dft-book/"
	 :base-extension "org"
	 :publishing-directory "~/dft-book/gh-pages/"
	 :exclude "gh-pages\\|test\\|archive\\|molecules\\|surfaces\\|bulk\\|study-guides\\|blog\\|topics\\|index\\|help\\|header"
	 :recursive t
	 :publishing-function org-html-publish-to-html
	 :headline-levels 4             ; Just the default for this project.
	 :auto-preamble t
	 )
	("dft-book-static"
	 :base-directory "~/dft-book/"
	 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|svg"
	 :publishing-directory "/home-research/jkitchin/dft/course/dft-book/gh-pages/"
	 :exclude  "gh-pages\\|test/\\|archive/\\|molecules/\\|surfaces/\\|bulk/\\|study-guides/"
	 :recursive t
	 :publishing-function org-publish-attachment
	 )
	;; ... all the components ...
	("dft-book" :components ( "dft-book-content" "dft-book-static"))
	))
(setq org-image-actual-width nil)
(org-publish "dft-book")
#+END_SRC

#+RESULTS:
| dft-book-static | :base-directory | /home-research/jkitchin/dft/course/dft-book/ | :base-extension | css\ | js\ | png\ | jpg\ | gif\ | pdf\ | mp3\ | ogg\ | swf\ | svg | :publishing-directory | /home-research/jkitchin/dft/course/dft-book/gh-pages/ | :exclude | gh-pages\ | test/\ | archive/\ | molecules/\ | surfaces/\ | bulk/\ | study-guides/ | :recursive | t | :publishing-function | org-publish-attachment |

** html 2							    :archive:
I used to publish this, but now this only works for the static components

#+BEGIN_SRC emacs-lisp
(load-file "dft.el")
(find-file "dft.org")
(require 'ox-publish)
(setq org-publish-project-alist
      '(("dft-book-static"
	 :base-directory "~/dft-book/"
	 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|svg"
	 :publishing-directory "~/dft-book/gh-pages/"
	 :exclude  "gh-pages\\|test/\\|archive/\\|molecules/\\|surfaces/\\|bulk/\\|study-guides/"
	 :recursive t
	 :publishing-function org-publish-attachment
	 )
	;; ... all the components ...
	("dft-book" :components ("dft-book-static"))
	))
(setq org-image-actual-width nil)
(org-publish "dft-book")

(org-html-export-to-html)
(copy-file "dft.html" "gh-pages/dft.html" t)
#+END_SRC

** html 3

#+BEGIN_SRC emacs-lisp
(find-file "index.org")
(org-html-export-to-html)
(shell-command "rm -fr blog/source/files/dft.html blog/source/files/images")
(shell-command "cp -fr images blog/source/files")
(shell-command "cp -f dft.html blog/source/files")
(princ (format "dft (html) was built on %s" (current-time-string)))
#+END_SRC

#+RESULTS:
: dft (html) was built on Thu Jul 21 16:40:21 2016

** deploy the blog
Now, do this in a shell (so the virtual env will activate):

#+BEGIN_SRC sh
cd blog/source
nikola build
nikola github_deploy
#+END_SRC

#+RESULTS:

* Tests								   :noexport:
** Run all jobs

#+BEGIN_SRC emacs-lisp
(org-babel-execute-buffer)
#+END_SRC
